
## Plan Result

[CI link](https://github.com/hiyoko3m/memo-board/actions/runs/3122389166)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecs_service.memo_board_rs


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_service.memo_board_rs will be created
  + resource "aws_ecs_service" "memo_board_rs" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:281036478087:cluster/memo_board"
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "memo_board_rs"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "memo_board_rs:2"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "memo_board_rs"
          + container_port   = 3000
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/49a911a6c9d862a3"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-033af2ba0540ee42c",
            ]
          + subnets          = [
              + "subnet-047a19359c4468354",
              + "subnet-0ae15c749b9813fb9",
              + "subnet-0f84ebfae4c920a30",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":24,"Program":"tfcmt","SHA1":"1b5f2396aeebafe82f70a2c2aa6995473a3dbf86","Vars":{},"WorkflowName":"Terraform"} -->